ERM/src/Documents/BatchAllocation.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>BatchAllocation</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Client</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Account</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Lawson</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

ERM/src/InformationRegisters/КлючиBatchAllocation.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>КлючиBatchAllocation</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>BatchAllocation</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.BatchAllocation</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Client</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Account</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Lawson</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERM/src/Documents/BatchAllocation/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не ЭтоНовый() Тогда
		ДополнительныеСвойства.Вставить("СтарыеЗначенияКлючей", ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Client, Account, Currency"));
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ДополнительныеСвойства.Свойство("СтарыеЗначенияКлючей") Тогда
		
		СтарыеЗначенияКлючей = ДополнительныеСвойства.СтарыеЗначенияКлючей;
		Если СтарыеЗначенияКлючей.Client <> Client
			ИЛИ СтарыеЗначенияКлючей.Account <> Account
			ИЛИ СтарыеЗначенияКлючей.Currency <> Currency Тогда
			
			НЗ = РегистрыСведений.КлючиBatchAllocation.СоздатьНаборЗаписей();
			НЗ.Отбор.Client.Установить(СтарыеЗначенияКлючей.Client);
			НЗ.Отбор.Account.Установить(СтарыеЗначенияКлючей.Account);
			НЗ.Отбор.Currency.Установить(СтарыеЗначенияКлючей.Currency);
			НЗ.Записать(Истина);
			
			НЗ.Отбор.Client.Установить(Client);
			НЗ.Отбор.Account.Установить(Account);
			НЗ.Отбор.Currency.Установить(Currency);
			ЗаписьНабора = НЗ.Добавить();
			ЗаписьНабора.Client = Client;
			ЗаписьНабора.Account = Account;
			ЗаписьНабора.Currency = Currency;
			ЗаписьНабора.BatchAllocation = Ссылка;
			НЗ.Записать(Истина);
			
		КонецЕсли;
		
	Иначе
		
		НЗ = РегистрыСведений.КлючиBatchAllocation.СоздатьНаборЗаписей();
		НЗ.Отбор.Client.Установить(Client);
		НЗ.Отбор.Account.Установить(Account);
		НЗ.Отбор.Currency.Установить(Currency);
		ЗаписьНабора = НЗ.Добавить();
		ЗаписьНабора.Client = Client;
		ЗаписьНабора.Account = Account;
		ЗаписьНабора.Currency = Currency;
		ЗаписьНабора.BatchAllocation = Ссылка;
		НЗ.Записать(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	НЗ = РегистрыСведений.КлючиBatchAllocation.СоздатьНаборЗаписей();
	НЗ.Отбор.Client.Установить(Client);
	НЗ.Отбор.Account.Установить(Account);
	НЗ.Отбор.Currency.Установить(Currency);
	НЗ.Записать(Истина);
	
КонецПроцедуры
